[
  {
    "review_id": "7c755ca3-41ce-490c-ad9a-648601657453",
    "title": "arun k",
    "text": "For the past few days, I’ve been unable to open the app and keep getting the error “OOPS, SOMETHING WENT WRONG.” I updated the app, uninstalled it, and reinstalled it. After logging in, it worked fine the day before yesterday, but now I’m facing the same error again when opening the app. My internet bandwidth is good, so I’m not sure why the app is behaving like this.",
    "rating": 1,
    "date": "2025-09-20T00:00:00+00:00"
  },
  {
    "review_id": "fb372797-ab66-41e8-b77e-ac0a48bb5b70",
    "title": "Prashant Gupta",
    "text": "This is one of the best platforms for investment, but applying for an IPO is frustrating. Recently, the application process gets stuck on \"sending application to exchange,\" failing to generate a number or send a mandate. Other platforms like AngelOne and INDmoney are much faster. But I prefer using Groww, so I often have to cancel and reapply to get my application submitted, which is especially stressful on the final day.",
    "rating": 4,
    "date": "2025-09-19T00:00:00+00:00"
  },
  {
    "review_id": "edb92e0e-49cc-45c6-b041-45d8008946f2",
    "title": "SANT KUMAR",
    "text": "I've been using the Groww app for a while now, and it's fantastic for tracking investments, mutual funds, and buying/selling stocks. The UI is clean, and it's beginner-friendly. However, one feature that could take it to the next level would be stock recommendations for both long-term investments and short-term trades (like swing trading). It would be super helpful to get insights, expert analysis, or even curated stock lists based on different time horizons and risk appetites.",
    "rating": 4,
    "date": "2025-09-19T00:00:00+00:00"
  },
  {
    "review_id": "bffdd033-cfac-4948-9271-3315e2af3dc0",
    "title": "Rakesh Sarma",
    "text": "#Go for another broker. This app has been giving a lot of issues. It is not working well in the commodity section. While putting buy/sell orders in options the executed orders don't appear immediately in the positions . it takes a lot of time. Very slow app. The interface was not this bad earlier. Bugs may be there too. The Worst customer service. Calls are not picked up.",
    "rating": 1,
    "date": "2025-09-18T00:00:00+00:00"
  },
  {
    "review_id": "f861a1cc-8e13-4726-9d31-967af7c9dfd2",
    "title": "Vishu",
    "text": "Heard about it from a friend. But had to immediately uninstalled. At initial setup, it's too easy to accidentally choose some options. You can't go back and correct the choices. And these can not be changed later in settings as well. Also it's terrible at account deletion. Once in, it's a nightmare to exit. Do not get into the trap!",
    "rating": 1,
    "date": "2025-09-27T00:00:00+00:00"
  },
  {
    "review_id": "724048f6-ff86-4ea6-946d-3ecf993b7274",
    "title": "Adi Sharma",
    "text": "Best experience 👌 overall! But I faced one issue — I bought 3 stocks and tried paying via Fampay UPI but the payment didn’t go through. Also, the brokerage charges feel a bit high — even when I get ₹2–₹3 profit, ₹10–₹20 gets deducted, which is frustrating. Please fix this issue, otherwise Groww is really one of the best and most user-friendly trading apps! 🔥",
    "rating": 5,
    "date": "2025-10-05T00:00:00+00:00"
  },
  {
    "review_id": "a462244c-b4d5-45a4-8fe4-31041da25417",
    "title": "Karan Govindani",
    "text": "I regret choosing this platform. While the user interface looks polished and onboarding was smooth, the app fails spectacularly at the absolute most critical time for any trader: market opening. Every single morning, without fail, as the clock hits 9:15 AM (or within the first five crucial minutes), the servers completely seize up. The app becomes unresponsive, trades won't execute, and worst of all, I can't exit positions. This isn't a minor glitch; it is a fundamental flaw",
    "rating": 1,
    "date": "2025-10-03T00:00:00+00:00"
  },
  {
    "review_id": "1c9e3dd1-999b-4ae9-ba69-72f4933354da",
    "title": "Malhar Meher",
    "text": "I'm very disappointed with this app. Used to like this app because of it's super fast order placements and simple UI. but on 14th October, I was placing my order to sell shares of LG at 50% but due to some error I wasn't able to sell. I tried 4 times but it failed. After 15minutes, I did sell the shares but at less profit at 44%. Hence I was able to book less profit. If such problem continues I may suffer a huge loss in the future. that's why I don't want to use this app anymore.",
    "rating": 1,
    "date": "2025-10-16T00:00:00+00:00"
  },
  {
    "review_id": "21c135b2-a63e-47d4-9b9f-429f38e42cd7",
    "title": "Abhishek Kumar",
    "text": "The app is becoming worse day by day. I have seen too many glitches in the recent days, sometimes wallet balance is incorrect, sometimes login doesn't work, sometimes you can't make payments etc etc. With every glitch, my trust is eroding from this app. Update (23 Oct 2025) - I don't think they are able to handle the volume of transactions happening on their platform. Glitches still occur and now happen repeatedly. Price alerts for ETFs do not work at all.",
    "rating": 1,
    "date": "2025-10-23T00:00:00+00:00"
  },
  {
    "review_id": "d07786b1-15af-456e-87d0-414de009e168",
    "title": "Sukesh Shetty",
    "text": "Super impressed! The documentation process was incredibly quick and effortless. All my mutual funds were auto-loaded from the central repository, requiring zero manual effort. The best part was that it even retrieved some of my old mutual funds that I no longer had records of. I also raised a redemption request, which was processed swiftly. If the payout is completed within the estimated timeline, this would be an outstanding overall experience.",
    "rating": 5,
    "date": "2025-11-02T00:00:00+00:00"
  },
  {
    "review_id": "ed27b3b5-ff2d-4911-8f57-f880d662838e",
    "title": "43 Noah Jehiel Vaz",
    "text": "Groww is one of the smoothest and easiest apps for beginners in trading and investing. The interface is clean, buying and selling stocks is simple, and GTT orders make it beginner-friendly. However, the app still needs a few advanced features like stop-loss / take-profit for delivery trades and trailing stop-loss options for swing traders. Adding those would make Groww perfect for both new and active users. Overall, it’s great for starting out, learning, and building a long-term portfolio",
    "rating": 4,
    "date": "2025-10-30T00:00:00+00:00"
  },
  {
    "review_id": "cf48252a-9ef7-401a-899a-63144d5f9534",
    "title": "Linson Thelappillil",
    "text": "Couple of issues that can be addressed. Many brokers allow the details of the trades along with the charges to be downloaded in the Excel format for uploading the data to another Excel sheet maintained by them. Groww needs to work on this aspect. 2. when I transact, the rate given on the screen is seemed to be higher than prevailing rate if a buy is being placed and similar for a sell transaction. I would like a situation where the rate on the screen is blank and filled by the trader.",
    "rating": 5,
    "date": "2025-11-09T00:00:00+00:00"
  },
  {
    "review_id": "66db8b04-b8bd-4b09-a040-481398d21c55",
    "title": "Vishnu K",
    "text": "I have faced an issue while converting my intraday to delivery. The application said you have sufficient balance but there is an error for the conversion. I couldn't convert and they deducted the roundoff money. I have contacted the costomer care but they said, I didn't have sufficient money for the convertion. that is, we need to pay for their errors too. I had screenshots but no reply, nothing....",
    "rating": 1,
    "date": "2025-11-13T00:00:00+00:00"
  },
  {
    "review_id": "8d81989a-da73-40b6-937e-d56ca5f375a7",
    "title": "sampark rana",
    "text": "Really disappointed been using the app from almost 8 months initially the app was very good but now its buggy like hell every other day cannot place orders. When placing order in intraday it place order really late and sometimes even after 20 mins order pending and when the place the order already miss on profits. Even today market is open from 15 mins and still can't place new orders really getting in my nerves now. If you guys keep on going like this wont take long for people to move to others",
    "rating": 1,
    "date": "2025-11-12T00:00:00+00:00"
  }
]