[
  {
    "review_id": "d0b0bfcd-39d4-4726-b09d-be1981e405bd",
    "title": "harsh suneja",
    "text": "Slowest app ever seen.. The data is showing different wverytime,for example, in Premium it was showing 100 but in oi chart it was showing 90 and in positions it was showing 98... worst app ever... Doesn't protest profit. like i set my profit at 5000, if it hit the target.. it never be accurate. it's always hit lesser than safe profit position.. doesn't show balance properly, if you do BTST in commodity, and you sell it next day.. so your balance amount wouldn't ahow in your wallet untill settmnt",
    "rating": 1,
    "date": "2025-11-14T00:00:00+00:00"
  },
  {
    "review_id": "66db8b04-b8bd-4b09-a040-481398d21c55",
    "title": "Vishnu K",
    "text": "I have faced an issue while converting my intraday to delivery. The application said you have sufficient balance but there is an error for the conversion. I couldn't convert and they deducted the roundoff money. I have contacted the costomer care but they said, I didn't have sufficient money for the convertion. that is, we need to pay for their errors too. I had screenshots but no reply, nothing....",
    "rating": 1,
    "date": "2025-11-13T00:00:00+00:00"
  },
  {
    "review_id": "8d81989a-da73-40b6-937e-d56ca5f375a7",
    "title": "sampark rana",
    "text": "Really disappointed been using the app from almost 8 months initially the app was very good but now its buggy like hell every other day cannot place orders. When placing order in intraday it place order really late and sometimes even after 20 mins order pending and when the place the order already miss on profits. Even today market is open from 15 mins and still can't place new orders really getting in my nerves now. If you guys keep on going like this wont take long for people to move to others",
    "rating": 1,
    "date": "2025-11-12T00:00:00+00:00"
  },
  {
    "review_id": "cf48252a-9ef7-401a-899a-63144d5f9534",
    "title": "Linson Thelappillil",
    "text": "Couple of issues that can be addressed. Many brokers allow the details of the trades along with the charges to be downloaded in the Excel format for uploading the data to another Excel sheet maintained by them. Groww needs to work on this aspect. 2. when I transact, the rate given on the screen is seemed to be higher than prevailing rate if a buy is being placed and similar for a sell transaction. I would like a situation where the rate on the screen is blank and filled by the trader.",
    "rating": 5,
    "date": "2025-11-09T00:00:00+00:00"
  },
  {
    "review_id": "2bd70c8b-53a2-4b35-8db2-e14e86398508",
    "title": "Sahil J",
    "text": "Hey Groww team, I have one request for a new feature: could you integrate AI inside the app that can analyze my portfolio, my stocks, and give a detailed understanding of the price of every stock on a day-to-day basis? I rely on Perplexity to understand why a stock is going up or down daily, but if you have an AI that does everything for me, I would like An AI that provides me with current insights of news and stocks movements and provide for investment and trading advice, I need it. 🤖🧠🫂",
    "rating": 5,
    "date": "2025-11-04T00:00:00+00:00"
  },
  {
    "review_id": "d07786b1-15af-456e-87d0-414de009e168",
    "title": "Sukesh Shetty",
    "text": "Super impressed! The documentation process was incredibly quick and effortless. All my mutual funds were auto-loaded from the central repository, requiring zero manual effort. The best part was that it even retrieved some of my old mutual funds that I no longer had records of. I also raised a redemption request, which was processed swiftly. If the payout is completed within the estimated timeline, this would be an outstanding overall experience.",
    "rating": 5,
    "date": "2025-11-02T00:00:00+00:00"
  },
  {
    "review_id": "ed27b3b5-ff2d-4911-8f57-f880d662838e",
    "title": "43 Noah Jehiel Vaz",
    "text": "Groww is one of the smoothest and easiest apps for beginners in trading and investing. The interface is clean, buying and selling stocks is simple, and GTT orders make it beginner-friendly. However, the app still needs a few advanced features like stop-loss / take-profit for delivery trades and trailing stop-loss options for swing traders. Adding those would make Groww perfect for both new and active users. Overall, it’s great for starting out, learning, and building a long-term portfolio",
    "rating": 4,
    "date": "2025-10-30T00:00:00+00:00"
  },
  {
    "review_id": "21c135b2-a63e-47d4-9b9f-429f38e42cd7",
    "title": "Abhishek Kumar",
    "text": "The app is becoming worse day by day. I have seen too many glitches in the recent days, sometimes wallet balance is incorrect, sometimes login doesn't work, sometimes you can't make payments etc etc. With every glitch, my trust is eroding from this app. Update (23 Oct 2025) - I don't think they are able to handle the volume of transactions happening on their platform. Glitches still occur and now happen repeatedly. Price alerts for ETFs do not work at all.",
    "rating": 1,
    "date": "2025-10-23T00:00:00+00:00"
  },
  {
    "review_id": "bdefa58a-ca74-4230-a9ee-00c3e562f8cd",
    "title": "Rohan Ingle",
    "text": "This is the worst platform for trading and investing, especially for beginners. They bail out on you at the very crucial moment. I have been trying to sell my share from yesterday, either app crashes during procedures or even after completing all procedures my order is not placed. It's just not that even during the purchase app crashes like it's deliberately doesn't want you to make profit. I'm so much disappointed.",
    "rating": 1,
    "date": "2025-10-14T00:00:00+00:00"
  },
  {
    "review_id": "fb372797-ab66-41e8-b77e-ac0a48bb5b70",
    "title": "Prashant Gupta",
    "text": "This is one of the best platforms for investment, but applying for an IPO is frustrating. Recently, the application process gets stuck on \"sending application to exchange,\" failing to generate a number or send a mandate. Other platforms like AngelOne and INDmoney are much faster. But I prefer using Groww, so I often have to cancel and reapply to get my application submitted, which is especially stressful on the final day.",
    "rating": 4,
    "date": "2025-09-19T00:00:00+00:00"
  },
  {
    "review_id": "edb92e0e-49cc-45c6-b041-45d8008946f2",
    "title": "SANT KUMAR",
    "text": "I've been using the Groww app for a while now, and it's fantastic for tracking investments, mutual funds, and buying/selling stocks. The UI is clean, and it's beginner-friendly. However, one feature that could take it to the next level would be stock recommendations for both long-term investments and short-term trades (like swing trading). It would be super helpful to get insights, expert analysis, or even curated stock lists based on different time horizons and risk appetites.",
    "rating": 4,
    "date": "2025-09-19T00:00:00+00:00"
  }
]